# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 2  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple
anchors:
  - [10,14, 23,27]  # P4/16
  - [81,82, 100,127]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [12, 5, 2, 2]],  # 0-P1/2
   [-1, 1, Conv, [12, 3, 2]],  # 1-P2/4
   [-1, 1, C3, [12, False]],
   [-1, 1, Conv, [16, 3, 2]],  # 3-P3/8
   [-1, 1, C3, [16, False]],
   [-1, 1, Conv, [32, 3, 2]],  # 5-P4/16
   [-1, 1, C3, [32, False]],
   [-1, 1, Conv, [64, 3, 2]],  # 7-P5/32
   [-1, 1, C3, [64, False]],
   [-1, 1, SPPF, [64, 5]],  # 9
  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, Conv, [96, 3, 1]],
   [-1, 1, Conv, [32, 1, 1]],
   [-1, 1, Conv, [64, 3, 1]],  # 12-P5/32-large

   [-2, 1, Conv, [16, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 6], 1, Concat, [1]],  # 15-cat backbone P4
   [-1, 1, Conv, [32, 3, 1]],  # 16-P4/16-medium
   [[12, 16], 1, Detect, [nc, anchors]],  # Detect(P5, P4)
  ]
