# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 2  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple
anchors:
  - [5,5,20,20]  # P4/16
  - [30,30,40,40]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [8, 3, 2]],  # 0-P1/2
   [-1, 1, Conv, [12, 3, 2]],  # 1-P2/4
   [-1, 1, C3, [12]],
   [-1, 1, Conv, [16, 3, 2]],  # 3-P3/8
   [-1, 1, C3, [16]],
   [-1, 1, Conv, [24, 3, 2]],  # 5-P4/16
   [-1, 1, C3, [24]],
   [-1, 1, Conv, [32, 3, 2]],  # 7-P5/32
   [-1, 1, C3, [32]],
  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, Conv, [32, 3, 1]],
   [-1, 1, C3, [32, False]],  # 
   [-5, 1, Conv, [24, 3, 1]],
   [-1, 1, C3, [24, False]],  # 
   [[-1, -3], 1, Detect, [nc, anchors]],  # Detect(P4, P5)
  ]
