# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 2  # number of classes
depth_multiple: 1.33  # model depth multiple
width_multiple: 1.25  # layer channel multiple
anchors:
  - [90,120] # P5/32
  - [30,40]  # P4/16
  - [6,8]  # P3/8

  

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [12, 5, 2, 2]],  # 0-P1/2
   [-1, 1, Conv, [8, 3, 2]],  # 1-P2/4
   [-1, 1, C3, [8, False]],
   [-1, 1, Conv, [8, 3, 2]],  # 3-P3/8
   [-1, 1, C3, [16, False]],
   [-1, 1, Conv, [16, 3, 2]],  # 5-P4/16
   [-1, 1, C3, [32, False]],
   [-1, 1, Conv, [32, 3, 2]],  # 7-P5/32
   [-1, 1, C3, [64, False]],
   [-1, 1, SPPF, [64, 5]],  # 9
  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, Conv, [64, 3, 1]], # 10-head-P5/32-large
   [-1, 1, Conv, [32, 1, 1]],  # 11
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 6], 1, Concat, [1]],  # 13-cat backbone P4
   [-1, 1, Conv, [32, 3, 1]],  # 14-head-P4/16-medium
   [-1, 1, Conv, [16, 1, 1]],  # 15
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], # 15-P3/8
   [[-1, 3], 1, Concat, [1]],  # 16-cat backbone P4
   [-1, 1, Conv, [8, 3, 1]],  # 17-head-P3/8-small
   [[10, 14, 17], 1, Detect, [nc, anchors]],  # Detect(P5, P4, P3)
  ]
