# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 2  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple 
anchors:
  # - [12,12, 24, 24]  # P4/16  8x6
  - [24, 24, 48, 48]  # P4/16  8x6
  # - [36,36, 48,48]  # P5/32  4x3

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [
   [-1, 1, DWConv, [12, 3, 2]],  # 
   [-1, 1, Conv, [12, 1, 1]],  # 
   [-1, 1, DWConv, [24, 3, 2]],
   [-1, 1, Conv, [16, 1, 1]], #
   [-1, 1, DWConv, [32, 3, 2]],
   [-1, 1, Conv, [24, 1, 1]], #
   [-1, 1, DWConv, [48, 3, 2]],
   [-1, 1, SPPF, [48, 3]],  
  ]

# YOLOv5 v6.0 head
head:
  [
    [[-1, 6], 1, Concat, [1]],
    [-1, 1, Conv, [16, 1, 1]],
    [-1, 1, Conv, [32, 3, 1]],
    [[10], 1, Detect, [nc, anchors]],  
  ]
