# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 2  # number of classes
depth_multiple: 0.0625  # model depth multiple
width_multiple: 0.125  # layer channel multiple
anchors:
  - [16, 24, 48, 64]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 5, 2]],  # 0-P1/2
   [-1, 1, Conv, [96, 3, 2]],  # 1-P2/4
   [-1, 3, C3, [96]],
   [-1, 1, Conv, [128, 3, 2]],  # 3-P3/8
   [-1, 1, Conv, [256, 3, 2]],  # 4-P4/16
   [-1, 1, SPPF, [256, 3]],  # 5
  ]

# YOLOv5 v6.0 head
head:
  [
   [-1, 1, Conv, [256, 1, 1]],  # 6 (P4/16-medium)
   [[6], 1, Detect, [nc, anchors]],  # Detect(P5)
  ]
